carstenbund/mementum-lcd/poc/firmware/idf/sdkconfig.defaults
# What the bring-up plan's memory arithmetic requires, stated once so
# `idf.py build` does not need a menuconfig session to be reproducible.

CONFIG_IDF_TARGET="esp32s3"

# Use our lv_conf.h rather than Kconfig. LVGL's Kconfig defaults LV_CONF_SKIP to
# y, which would quietly configure the device differently from the host -- and
# "the two renderers draw the same picture" is a property of that file as much
# as of the code.
CONFIG_LV_CONF_SKIP=n

# LVGL's examples and demos are Kconfig-gated, not lv_conf-gated: the first
# build compiled 1878 targets, several hundred of which were widget examples
# nothing references. Off.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# PSRAM is not optional: a six-path scene is ~450 KB of parsed geometry and a
# 450x250 ARGB8888 canvas is another 450 KB, against 512 KB of internal SRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Anything this size goes to PSRAM without the caller asking; below it, the
# internal heap, which is faster and is where LVGL's small objects belong.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# partitions.csv gives the app 3 MB. The built image is 565 KB, so this is
# headroom rather than need -- see docs/esp32-bring-up.md.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Exceptions and RTTI off: ThorVG builds without them and they cost flash.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# A stack big enough to parse a scene. mm_path_parse is no longer a ~98 KB
# stack local (it was once, and it presented as heap corruption), but the JSON
# loader still recurses.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
